src/Catalogs/ВидыОбъектовКонтроля/ВидыОбъектовКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОбъектовКонтроля</name>
  <predefined>
    <items>
      <name>ИнформационнаяБаза</name>
      <description>Информационные базы</description>
    </items>
    <items>
      <name>КластерСерверов1С</name>
      <description>Кластеры серверов 1С:Предприятия</description>
    </items>
    <items>
      <name>РабочийСервер</name>
      <description>Рабочие серверы</description>
    </items>
    <items>
      <name>ЦентрКонтроляКачества</name>
      <description>Центры контроля качества</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/CommonModules/НастройкиКонстантыСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Неизменяемые параметры настроек объектов контроля и контрольных процедур
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает Соответствие, в котором ключи - 
// существующие в системе виды объектов контроля, а
// значения - названия регистров сведения, в которых хранятся 
// настройки
Функция ВидОбъектаКонтроляВНазваниеРегистраНастроек() Экспорт
	НазванияРегСвед = Новый Соответствие();
	НазванияРегСвед.Вставить(Справочники.ВидыОбъектовКонтроля.ИнформационнаяБаза, "ПараметрыИнформационныхБаз");
	НазванияРегСвед.Вставить(Справочники.ВидыОбъектовКонтроля.РабочийСервер, "ПараметрыРабочихСерверов");
	НазванияРегСвед.Вставить(Справочники.ВидыОбъектовКонтроля.ЦентрКонтроляКачества, "ПараметрыЦКК");
    НазванияРегСвед.Вставить(Справочники.ВидыОбъектовКонтроля.КластерСерверов1С, "ПараметрыКластеров");
	
    Возврат НазванияРегСвед;			
КонецФункции
